app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contact = Contact.all

INSERT INTO `contacts` (`created_at`, `name`, `phone`, `updated_at`) VALUES (?, ?, ?, ?)  [["created_at", "2015-02-03 17:22:15"], ["name", "Dilip"], ["phone", "1234565690"], ["updated_at", "2015-02-03 17:22:15"]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

UPDATE `contacts` SET `email` = ?, `updated_at` = ? WHERE `contacts`.`id` = 1  [["email", "farji@sao.com"], ["updated_at", "2015-02-03 17:22:44"]]
---
  def update
    if @contact.update_attributes(contact_params)

DELETE FROM `contacts` WHERE `contacts`.`id` = ?  [["id", 1]]
---
  def destroy
    @contact.destroy